XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A34M41x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A34M41x_Series</name>
  <description>ABOV Semiconductor CM4 Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.01.0" date="2020-04-21">
            First Release version of ABOV CM4 Series Pack.
            - Added device : A34M41x
    </release>
  </releases>
  <keywords>
    <keyword>ABOV</keyword>
    <keyword>A34M41x Series</keyword>
    <keyword>Motor</keyword>
  </keywords>
  <devices>
    <family Dfamily="A34M41x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p0" Dfpu="1" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV M4 Series device family with a versatile set of on-chip peripherals
            </description>
      <!-- Subfamily : A34M41x *********************************************************-->
      <subFamily DsubFamily="A34M41x">
        <processor Dclock="120000000" />
        <compile header="A34M41x\Core\Device\ABOV\A34M41x\Include\A34M41x.h" />
        <debug svd="A34M41x\SVD\A34M41x.svd" />
        <!-- <book name="A34M41x\Doc\UM_A34M41x_V1.0.0_EN.pdf" title="A34M41x Series Data Sheet" /> -->
        <algorithm name="A34M41x\Flashloader\A34M41x_CFLASH.FLM" start="0x00000000" size="0x80000" default="1" />
		<algorithm name="A34M41x\Flashloader\A34M41x_DFLASH.FLM" start="0x0E000000" size="0x8000" default="1" />
        <feature type="VCC" n="2.70" m="5.50" />
        <feature type="Temp" n="-40" m="85" />
        <memory id="IROM1" start="0x00000000" size="0x80000" startup="1" default="1" />
        <memory id="IRAM1" start="0x20000000" size="0x10000" init="0" default="1" />
        <feature type="WDT" n="1" m="32" name="Watchdog Timer" />
        <feature type="Other" n="2" m="32" name="FRT" />
        <feature type="Timer" n="10" m="16" name="Timer" />
        <feature type="MPWM" n="2" m="16" name="MPWM" />
        <feature type="CAN" n="1" name="CAN" />

        <!-- Device : A34M418 -->
        <device Dname="A34M418">
          <description>Package type 120LQFP</description>
          <feature type="IOs" n="108" name="Inputs/Outputs" />
          <feature type="QFP" n="120" name="LQFP" />
		  <feature type="ADC" n="3" m="24" name="ADC" />
          <feature type="I2C" n="2" name="I2C" />
          <feature type="UART" n="6" name="UART" />
          <feature type="SPI" n="3" name="SPI" />
        </device>

        <!-- Device : A34M416 -->
        <device Dname="A34M416">
          <description>Package type 100LQFP</description>
          <memory id="IROM1" start="0x00000000" size="0x40000" startup="1" default="1" />
          <feature type="IOs" n="90" name="Inputs/Outputs" />
          <feature type="QFP" n="100" name="LQFP" />
		  <feature type="ADC" n="3" m="24" name="ADC" />
          <feature type="I2C" n="2" name="I2C" />
          <feature type="UART" n="6" name="UART" />
          <feature type="SPI" n="2" name="SPI" />
        </device>

        <!-- Device : A34M414 -->
        <device Dname="A34M414">
          <description>Package type 64LQFP</description>
          <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
          <memory id="IRAM1" start="0x20000000" size="0x8000" init="0" default="1" />
          <feature type="IOs" n="52" name="Inputs/Outputs" />
          <feature type="QFP" n="64" name="LQFP" />
		  <feature type="ADC" n="3" m="16" name="ADC" />
          <feature type="I2C" n="1" name="I2C" />
          <feature type="UART" n="3" name="UART" />
          <feature type="SPI" n="1" name="SPI" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <!-- condition : A34M41x ********************************************************-->
    <condition id="A34M41x CMSIS">
      <description>A34M418, A34M416, A34M414 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A34M418" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A34M416" />
	  <accept Dvendor="ABOV Semiconductor:126" Dname="A34M414" />
    </condition>
  </conditions>
  <components>
    <!-- component : A34M41x *************************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>System Startup for ABOV A34M41x devices</description>
      <files>
        <file category="include" name="A34M41x\Core\Device\ABOV\A34M41x\Include\" />
        <file category="include" name="A34M41x\Drivers\Include\" />
        <file category="header" version="1.0.0" name="A34M41x\Core\Device\ABOV\A34M41x\Include\A34M41x.h" attr="config" />
        <file category="source" version="1.0.0" name="A34M41x\Core\Device\ABOV\A34M41x\Source\ARM\startup_A34M41x.s" attr="config" />
        <file category="header" version="1.0.0" name="A34M41x\Core\Device\ABOV\A34M41x\Include\system_A34M41x.h" attr="config" />
        <file category="source" version="1.0.0" name="A34M41x\Core\Device\ABOV\A34M41x\Source\system_A34M41x.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x debug framework</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_debug_frmwrk.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x ADC control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_adc.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_adc.c" />
      </files>
    </component>
