XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A34M41x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="CFMC" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Flash Memory Controller</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_cfmc.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_cfmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="DFMC" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Data Flash Memory Controller</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_dfmc.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_dfmc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="DMA" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Direct Memory Access Controller</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_dma.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_dma.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FRT" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x 32-bit Free-Run Timer control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_frt.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_frt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x I2C control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_i2c.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Port Map controller</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_pcu.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SCU" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Power Management Unit</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_scu.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="MPWM" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x MPWM control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_mpwm.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_mpwm.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x SPI control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_spi.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="QEI" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x QEI control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_qei.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_qei.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PGA" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x PGA control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_pga.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_pga.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="COMP" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Comparator control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_comp.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_comp.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="AES128" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x AES128 control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_aes128.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_aes128.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="RNG" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x RNG control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_rng.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_rng.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x CRC control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_crc.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x UART control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_uart.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_uart.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x WDT control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_wdt.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Timer" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x Timer control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34m41x_hal_timer.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_timer.c" />
      </files>
    </component>
