XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A34M41x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="PWR" Cversion="1.0.0" condition="A34M41x CMSIS">
      <description>A34M41x PWR control</description>
      <files>
        <file category="header" name="A34M41x\Drivers\Include\A34M41x_hal_pwr.h" />
        <file category="source" name="A34M41x\Drivers\Source\A34M41x_hal_pwr.c" />
      </files>
    </component>
  </components>
  <boards>
    <!-- component : A34M41x *************************************************************-->
    <board vendor="ABOV" name="StarterKit-A34M418VLN" revision="V1.1">
      <description>StarterKit-A34M418VLN</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A34M418"/>
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A34M416"/>
	  <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A34M414"/>
      <feature type="XTAL" n="8000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs : D101~D106" />
	  <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
  </boards>
  <examples>
    <!-- example : A34M41x **********************************************************-->
    <example name="ABOV ADC Burst Test" doc="Abstract.txt" folder="A34M41x\Examples\ADC\ADC_Burst">
      <description>ADC Burst Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Burst.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\ADC\ADC_Interrupt">
      <description>ADC Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Multiple Test" doc="Abstract.txt" folder="A34M41x\Examples\ADC\ADC_Multiple">
      <description>ADC Multiple Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Multiple.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Polling Test" doc="Abstract.txt" folder="A34M41x\Examples\ADC\ADC_Polling">
      <description>ADC Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Sequence Test" doc="Abstract.txt" folder="A34M41x\Examples\ADC\ADC_Seq">
      <description>ADC Sequence Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Seq.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV AES128 Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\AES128\AES128_interrupt">
      <description>AES128 Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\AES128_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV AES128 Polling Test" doc="Abstract.txt" folder="A34M41x\Examples\AES128\AES128_polling">
      <description>AES128 Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\AES128_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Comparator Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\COMP\COMP_interrupt">
      <description>Comparator Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\COMP_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Comparator Polling Test" doc="Abstract.txt" folder="A34M41x\Examples\COMP\COMP_polling">
      <description>Comparator Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Comp_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Test" doc="Abstract.txt" folder="A34M41x\Examples\CRC\CRC">
      <description>CRC Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CRC.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DMA Test" doc="Abstract.txt" folder="A34M41x\Examples\DMA\DMA_Test">
      <description>DMA Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\DMA_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV DMA ADC Test" doc="Abstract.txt" folder="A34M41x\Examples\DMA\DMA_ADC_Test">
      <description>DMA ADC Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\DMA_ADC_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
	<example name="ABOV DMA SPI Polling Test" doc="Abstract.txt" folder="A34M41x\Examples\DMA\DMA_SPI_Polling">
      <description>DMA SPI Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\DMA_SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Flash Memory Controller Test" doc="Abstract.txt" folder="A34M41x\Examples\FMC\CFMC_WriteErase">
      <description>Flash Memory Controller Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CFMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Data Flash Memory Controller Test" doc="Abstract.txt" folder="A34M41x\Examples\FMC\DFMC_WriteErase">
      <description>Data Flash Memory Controller Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\DFMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Floating Point Unit Test" doc="Abstract.txt" folder="A34M41x\Examples\FPU\FPU Test">
      <description>Floating Point Unit Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FPU_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Free-run Timer Test" doc="Abstract.txt" folder="A34M41x\Examples\FRT\FRT_Test">
      <description>Free-run Timer Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FRT_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO External Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\GPIO\Gpio_ExtInt">
      <description>GPIO External Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_ExtInt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Input Test" doc="Abstract.txt" folder="A34M41x\Examples\GPIO\Gpio_Input">
      <description>GPIO Input Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO LED Blinky Test" doc="Abstract.txt" folder="A34M41x\Examples\GPIO\Gpio_LedBlinky">
      <description>GPIO LED Blinky Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C Test" doc="Abstract.txt" folder="A34M41x\Examples\I2C\I2C_MasterSlave">
      <description>I2C Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2C_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV MPWM Test" doc="Abstract.txt" folder="A34M41x\Examples\MPWM\MPWM_Test">
      <description>MPWM Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\MPWM_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PGA Test" doc="Abstract.txt" folder="A34M41x\Examples\PGA\PGA_test">
      <description>PGA Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PGA_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LVI Test" doc="Abstract.txt" folder="A34M41x\Examples\PWR\LVI">
      <description>LVI Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVI.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DeepSleep Test" doc="Abstract.txt" folder="A34M41x\Examples\PWR\PWR_DeepSleep">
      <description>DeepSleep Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWR_DeepSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Sleep Test" doc="Abstract.txt" folder="A34M41x\Examples\PWR\PWR_Sleep">
      <description>Sleep Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWR_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV QEI Test" doc="Abstract.txt" folder="A34M41x\Examples\QEI\QEI_Test">
      <description>QEI Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\QEI_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV RNG Test" doc="Abstract.txt" folder="A34M41x\Examples\RNG\RNG">
      <description>RNG Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\RNG_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\SPI\SPI_Interrupt">
      <description>SPI Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Polling Test" doc="Abstract.txt" folder="A34M41x\Examples\SPI\SPI_Polling">
      <description>SPI Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SRAM Test" doc="Abstract.txt" folder="A34M41x\Examples\SRAM\SRAM_WriteErase">
      <description>SRAM Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SRAM_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="A34M41x\Examples\StarterKit\Gpio_LedBlinky">
      <description>Starter Kit - Gpio_LedBlinky (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER Capture Test" doc="Abstract.txt" folder="A34M41x\Examples\TIMER\Timer_Capture">
      <description>TIMER Capture Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER MatchInterrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\TIMER\Timer_MatchInterrupt">
      <description>TIMER Match Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER MatchPolling Test" doc="Abstract.txt" folder="A34M41x\Examples\TIMER\Timer_MatchPolling">
      <description>TIMER Match Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER OneShot Test" doc="Abstract.txt" folder="A34M41x\Examples\TIMER\Timer_OneShot">
      <description>TIMER OneShot Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER PWM Test" doc="Abstract.txt" folder="A34M41x\Examples\TIMER\Timer_PWM">
      <description>TIMER PWM Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER SYNC Test" doc="Abstract.txt" folder="A34M41x\Examples\TIMER\Timer_SYNC">
      <description>TIMER SYNC Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Timer_SYNC.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\UART\UART_Interrupt">
      <description>UART Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\UART_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Polling Test" doc="Abstract.txt" folder="A34M41x\Examples\UART\UART_Polling">
      <description>UART Polling Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\UART_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Interrupt Test" doc="Abstract.txt" folder="A34M41x\Examples\WDT\WDT_Interrupt">
      <description>WDT Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Reset Test" doc="Abstract.txt" folder="A34M41x\Examples\WDT\WDT_Reset">
      <description>WDT Interrupt Test example (A34M418/416/414)</description>
      <board name="StarterKit-A34M418VLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>